---
kind: type
id: T:Autodesk.Revit.DB.TextListStyle
source: html/108dc35d-1698-446b-ee12-baea35080cc4.htm
---
# Autodesk.Revit.DB.TextListStyle

Supported styles of text list paragraphs.

## Syntax (C#)
```csharp
public enum TextListStyle
```